Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་དེ་བཞིན་གཤེགས་པས་ཆོས་ནག་པོའམ་དཀར་པོ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་པའོ།
en: The fiftieth is, “Lord, does a tathāgata apprehend bright, or dark, or bright and dark, or neither bright nor dark dharmas?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལགས་ན་ཇི་ལྟར་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཅིག་པའོ།
en: The fifty-first is, “Lord, if all phenomena are empty of their own marks, well then, how do bodhisattva great beings fully awaken to unsurpassed, perfect, complete awakening and free beings from the five forms of life in saṃsāra?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་སྡུག་བསྔལ་འཚལ་བས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གཉིས་པའོ།
en: The fifty-second is, “Lord, will beings pass into complete nirvāṇa on account of knowing suffering or will they pass into complete nirvāṇa on account of suffering?”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་སྤྱོད་ན་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་གསུམ་པའོ།
en: The fifty-third is, “Lord, how do bodhisattva great beings practicing the perfection of wisdom practice in order to awaken to the truths?”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཞེས་བགྱི་བ་གང་ལགས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བཞི་པའོ།
en: The fifty-fourth is, “Lord, what are ‘all dharmas as they really are’?”

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་ལགས་ན་བྱང་ཆུབ་དངོས་པོ་མ་མཆིས་ན་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་ལྔ་པའོ།
en: The fifty-fifth is, “In that case, Lord, is awakening not a real thing?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ཏེ་དེ་དག་སངས་རྒྱས་ཀྱིས་ཀྱང་མ་མཛད་ཅེས་བྱ་བ་ནི་ལྔ་བཅུ་དྲུག་པའོ།
en: The fifty-sixth is, “Lord, if all dharmas are in their nature not real things, if they have not been made by buddhas… why in these dharmas is there a distinction made between ‘these are beings in hell, these in the animal world’?”

source: །བཅོམ་ལྡན་འདས་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་གང་ལ་དངོས་པོའོ་ཞེས་མངོན་པར་ཞེན་པར་གྱུར་པ་དེ་ལྟ་བུའི་དངོས་པོ་བཞིན་མ་ནོར་བ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བདུན་པའོ།
en: The fifty-seventh is, “Lord, is there some real basis called suchness and unmistaken suchness that foolish, ordinary people stand on and settle down on as ‘a real basis’?”

source: །བཅོམ་ལྡན་འདས་ཡང་དག་པ་མཐོང་བ་ལ་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བའམ་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་བརྒྱད་པའོ།
en: The fifty-eighth is, “Lord, for someone who sees reality, defilement does not happen… well then, what purification has the Lord been speaking about?”

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་དེ་གང་ལགས་ཞེས་བྱ་བ་ནི་ལྔ་བཅུ་དགུ་པའོ།
en: The fifty-ninth is, “Lord, what is the sameness of all dharmas?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་པའོ།
en: The sixtieth is, “Lord, if all dharmas are like an illusion… how do bodhisattvas… produce the thought of unsurpassed, perfect, complete awakening?”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་གང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གཅིག་པའོ།
en: The sixty-first is, “Lord, is the dharma a tathāgata has fully awakened to, fully awakened to as an ordinary convention or as an ultimate?”

source: །བཅོམ་ལྡན་འདས་ཆོས་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་རྣམས་ལ་ཆོས་ཀྱི་མཉམ་པ་ཉིད་ཅེས་བགྱི་བ་ཡང་གང་ཞིག་མཆིས་ལགས་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གཉིས་པའོ།
en: The sixty-second is, “Lord, given that dharmas are in their nature nonexistent, what is this ‘sameness of dharmas’?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཆོས་མཉམ་པ་ཉིད་དེ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་གསུམ་པའོ།
en: The sixty-third is, “Lord, is that sameness of dharmas not within the range even of a tathāgata?”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་མངའ་བསྒྱུར་བ་མ་ལགས་སམ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་བཞི་པའོ།
en: The sixty-fourth is, “Lord, is a tathāgata, worthy one, perfectly complete buddha not in control of the entire range of dharmas?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་ལྔ་པའོ།
en: The sixty-fifth is, “Lord, if, in the sameness of all dharmas, ‘this is an ordinary person…’ all cannot be apprehended, in that case would foolish ordinary people… not have specific features?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་མཉམ་པ་ཉིད་ལ་སོ་སོའི་སྐྱེ་བོ་རྣམས་དང་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་དྲུག་པའོ།
en: The sixty-sixth is, “Lord, if, in the sameness of dharmas, foolish ordinary people… do not have specific features, well then, Lord, from where do the Three Jewels—the Buddha Jewel, Dharma Jewel, and Saṅgha Jewel—appear in the world?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཆོས་མཉམ་པ་ཉིད་ལས་མི་གཡོ་བ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་བདུན་པའོ།
en: The sixty-seventh is, “Lord, is the way in which a tathāgata does not move from the sameness of dharmas…?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་ཅེས་བྱ་བ་ནི་དྲུག་ཅུ་བརྒྱད་པའོ།
en: The sixty-eighth is, “Lord, if just that true dharmic nature of dharmas is just that true dharmic nature of ordinary people… given that those—namely, form…—have different marks… how do those dharmas with different marks come to have one mark?”

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་ཆོས་ཉིད་འདུས་བགྱིས་ལགས་སམ་ཞེས་བྱ་བ་ནི་དྲུག་ཅུ་དགུ་པའོ།
en: The sixty-ninth is, “Lord, is that true nature of dharmas a compounded phenomenon or is it an uncompounded phenomenon?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་པའོ།
en: The seventieth is, “Lord, if the sameness of all dharmas is empty of a basic nature, then no dharma does anything, so how, while dharmas are not doing anything and are not anything at all, do bodhisattvas not move from the ultimate but still work for the welfare of beings?”

source: །བཅོམ་ལྡན་འདས་ཅི་ཞིག་གིས་སྟོང་པ་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གཅིག་པའོ།
en: The seventy-first is, “Lord, of what is emptiness empty?”

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་འཇིག་རྟེན་པའི་ཆོས་འདི་དག་སྤྲུལ་པ་ལགས་ན་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གཉིས་པའོ།
en: The seventy-second is, “Lord, if those ordinary dharmas are magical creations, are these extraordinary dharmas… magical creations as well?”

source: །བཅོམ་ལྡན་འདས་གང་སྤངས་པ་ཞེས་བགྱི་བ་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་གསུམ་པའོ།
en: The seventy-third is, “Lord, are this ‘abandonment’… also magical creations as well?”

source: །བཅོམ་ལྡན་འདས་གང་མ་སྤྲུལ་པའི་ཆོས་དེ་གང་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་བཞི་པའོ།
en: The seventy-fourth is, “Lord, what is the dharma that is not a magical creation?”

source: །བཅོམ་ལྡན་འདས་དེ་གང་ལགས་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་ལྔ་པའོ།
en: The seventy-fifth is, “And what, Lord, is that?”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་དུ་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་དྲུག་པའོ། །བཅོམ་ལྡན་འདས་ལས་དང་པོ་པའི་གང་ཟག་གིས་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་ཡོངས་སུ་བཙལ་བར་བགྱི་ན་ཇི་ལྟར་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི་ཞེས་བྱ་བ་ནི་བདུན་ཅུ་བདུན་པའོ།
en: The seventy-sixth is, “Lord, according to what you have said…” And the seventy-seventh is, “Lord, if a person who is beginning the work is going to understand the emptiness of an intrinsic nature, how should they be advised and instructed?”

source: །ཞུས་པ་འདི་དག་ཐམས་ཅད་ཀྱི་འཁོར་དེ་ན་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱི་དོན་དང་། མ་འོངས་པའི་སྐྱེ་བོ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་ཞུས་པ་རིག་པར་བྱའོ།། །།
en: You should know that all these questions have been asked for the sake of irreversible bodhisattvas seated in the retinue and for the benefit of persons in the future.

source: བམ་པོ་ཉི་ཤུ་གསུམ་པ། དེ་ལ་རབ་འབྱོར་གཟུགས་ཟབ་པོ་ཞེས་བྱ་བ་ནི། འདིར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ལ་གཟུགས་ཀྱི་ཚིག་ཏུ་བརྗོད་དོ།
en: Explanation of Chapters 51 to 55 The deep places Among these, in regard to “Subhūti, form is deep,” here form is being used as a word for the suchness of form.

source: །དེ་བས་ན་ཇི་ལྟར་ཟབ་ཅེས་ཞུས་པ་དང་།
en: Therefore, it asks “why is form deep?”

source: རབ་འབྱོར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ཇི་ལྟ་བ་དེ་བཞིན་དུ་གཟུགས་ཟབ་པོ་ཞེས་བྱ་བས་དེ་བཞིན་ཉིད་ཁོ་ན་ཡིན་པར་བསྟན་ཏེ།
en: and says, “Subhūti… just as the suchness of form is deep, so too is form deep,” indicating that it is just suchness.

source: རྣམ་པ་གང་གིས་དེ་བཞིན་ཉིད་ཟབ་པའི་རྣམ་པ་དེས་གཟུགས་ཟབ་པོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means that form is deep in the way that suchness is deep.

source: །བཅོམ་ལྡན་འདས་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་ཇི་ལྟ་བུ་ལགས་ཞེས་ཞུས་པ་ཅི་ལས་དགོངས་ཤེ་ན་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ནི་རྣམ་པ་མེད་པ་སྟེ།
en: What is intended by the question, “Lord, what is the suchness of form like?”

source: གཟུགས་ལ་སོགས་པའི་མཚན་ཉིད་དམ། གཟུགས་ལ་སོགས་པ་ལ་རག་ལུས་པ་ཡང་མ་ཡིན་ན། གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དང་ཚོར་བའི་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་གཟུགས་ལ་སོགས་པའི་ཚིག་ཏུ་ཇི་ལྟར་བརྗོད་ཅེས་ཞུས་པའོ།
en: It is asking how, given that “suchness” is without attributes and hence is not the mark of form and is not contingent on form either, can you use the word form and so on in “the suchness of form, suchness of feeling”? “

source: །རབ་འབྱོར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་དེ་ལ་གཟུགས་ཀྱང་མེད།
en: Subhūti, there is no form in the suchness of form, and there is no suchness of form other than form.

source: གཟུགས་ལས་གུད་ན་ཡང་དེ་བཞིན་ཉིད་མེད་དེ་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་ནི་དེ་ལྟ་བུའོ་ཞེས་བྱ་བ་ནི།
en: The suchness of form is like that.”

source: ཀུན་བརྟགས་པ་སྤངས་ཏེ། ཀུན་བརྟགས་པ་ལས་གུད་ན་ཡོད་པའི་དེ་བཞིན་ཉིད་ཡོངས་སུ་གྲུབ་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ། གཟུགས་ལ་སོགས་པའི་སྒྲར་བརྗོད་དུ་མི་རུང་ངོ་།
en: Having eliminated falsely imagined phenomena, that thoroughly established suchness that is other than falsely imagined phenomena is separated from all mental images so it is not suitable to express it with the word “form” and so on.

source: །གང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་ཀུན་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་དང་དེ་དེ་ཉིད་དང་གཞན་དུ་བརྗོད་དུ་མི་རུང་བ་དྲི་མ་དང་བཅས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ། དེའི་གནས་སྐབས་ཉེ་བར་མཚོན་པའི་ཕྱིར་གཟུགས་ལ་སོགས་པའི་སྒྲར་སྒྲོ་བཏགས་ཏེ་ཐ་སྙད་དུ་བྱས་སོ་ཞེས་བསྟན་པའོ།
en: This is teaching that the name form and so on is superimposed onto suchness when it has stains, that it is not expressible as just that form and so on that foolish ordinary persons imagine, or other than that, in order to designate it during that period. “

source: །གཟུགས་ལས་ཀྱང་བཟློག་མྱ་ངན་ལས་འདས་པ་ཡང་བསྟན་ཞེས་བྱ་བ་ནི་གཟུགས་ཟབ་པོ་ཞེས་བྱ་བ་དེས་ཀུན་བརྟགས་པའི་གཟུགས་ལས་ནི་བཟློག །
en: Made to turn back from form, and nirvāṇa has been pointed out”— with that “form is deep” they are made to turn back from falsely imagined form. “

source: ཆོས་ཉིད་ཀྱི་གཟུགས་མྱ་ངན་ལས་འདས་པ་ནི་བསྟན་པའོ།
en: Nirvāṇa,” the true dharmic nature of form, “has been pointed out.”

source: །སྐྱེས་བུ་འདོད་ཆགས་ཅན་གྱི་དཔེ་ནི་གོ་སླའོ།
en: The illustration of the man with a strong libido is easy to understand. “

source: །ཉིན་གཅིག་ལ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་བཟུང་བ་དེས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་། དེས་ནི་དགེ་བའི་རྩ་བའི་དེའི་ལྷག་མའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ་ཞེས་བྱ་བ་ནི་ཉིན་གཅིག་ལ་དགེ་བའི་རྩ་བ་གང་བསྩགས་པ་དེས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་ཡོངས་སུ་གང་བར་གྱུར་ཀྱང་གང་གཱའི་ཀླུང་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་གང་བར་གྱུར་པའི་དགེ་བའི་རྩ་བ་དེའི་ཆ་བས་ལྷག་མ་ལུས་པའི་ཆ་མང་དུ་འགྱུར་ལ།
en: fill up as many world systems as there are sand particles in the Gaṅgā River with the wholesome roots appropriated in a single day … it still would not approach what remains of those wholesome roots even by one hundredth part” means that even if you were to fill up as many world systems as there are sand particles in the Gaṅgā River with those wholesome roots accumulated in a single day, there would be many parts left over from the one part of the wholesome roots that filled up as many world systems as the sand particles in the Gaṅgā River.

source: འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་གང་བའི་ཆ་ནི་ལྷག་མ་ལུས་པའི་ཆའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That part of the wholesome roots that filled up the world systems would not approach even a hundredth part of what remains of those wholesome roots. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བ་ཞིག་གིས་ཤེས་རབ་སྒོམ་པར་བྱེད་ན་ཞེས་བྱ་བ་ནི་དམིགས་སུ་མེད་པ་མཐོང་བའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཤེས་རབ་དང་མི་ལྡན་པར་འཇིག་རྟེན་པའི་ཤེས་རབ་འབའ་ཞིག་བསྒོམ་ན་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: If… separated from the perfection of wisdom [that bodhisattva] were to… cultivate wisdom” means if, without the wisdom of the knowledge of path aspects that sees what cannot be apprehended, they were to cultivate just ordinary wisdom.

source: །འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མའོ་ཞེས་བྱ་བ་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་བྱའོ།
en: Take “this perfection of wisdom is the mother of the bodhisattvas” as the knowledge of path aspects. “

source: །བཅོམ་ལྡན་འདས་གང་མངོན་པར་འདུ་བགྱིད་པ་ཐམས་ཅད་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་བརྟགས་པའོ་ཞེས་བཀའ་སྩལ་ན་ཇི་ལྟར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་འགྱུར་བ་ལགས་ཞེས་བྱ་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཀྱི་བདག་ཉིད་གང་དང་གང་མངོན་པར་འདུ་བྱེད་པ་དེ་ཀུན་བརྟགས་པ་ཡིན་ཏེ།
en: Lord, the Lord has said, ‘Whatever merit has been accumulated, it is all imaginary,’ so how will a son of a good family or daughter of a good family make a lot of merit?”

source: དེ་བས་ན་བསོད་ནམས་མང་དུ་འཕེལ་བར་མི་འགྱུར་རོ།
en: Whatever the composition of the merit bodhisattvas separated from the perfection of wisdom accumulated it is falsely imagined, so the merit will not increase a lot. “

source: །མངོན་པར་འདུ་བགྱིད་པ་མ་མཆིས་པ་ནི་དངོས་པོ་མ་མཆིས་པ་སྟེ།
en: What has been accumulated does not exist,” is a nonexistent thing.

source: དངོས་པོ་མ་མཆིས་པས་ནི་ཡང་དག་པའི་ལྟ་བ་དང་།
en: Since it is a nonexistent thing, “they will not be able to enter into the right view and the secure state of a bodhisattva,” and so on.

source: སྐྱོན་མ་མཆིས་པར་འཇུག་པ་ལ་སོགས་པ་བགྱིད་པར་ཡང་མི་ནུས་སོ་ཞེས་བྱ་བ་ནི་དེས་ཅི་ཡང་བྱེད་མི་ནུས་ན། དེ་ཇི་ལྟར་རིགས་པར་འགྱུར་ཞེས་གསོལ་པའོ།
en: He is asking how if they are not able to do anything could that be correct. “

source: །བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འདུ་བྱེད་པ་དེ་ཡང་སྟོང་པ་ཉིད་དུ་སྣང་ངོ་།
en: What [they]… have accumulated appears as just empty, appears as just in vain,” and so on.

source: །གསོབ་ཉིད་དུ་སྣང་ངོ་ཞེས་བྱ་བ་འདིས་འདི་སྐད་དུ་ང་ནི་མངོན་པར་འདུ་བྱེད་པས་བསོད་ནམས་འཕེལ་བར་ཡང་མི་སྨྲ། མངོན་པར་འདུ་བྱེད་པ་མེད་པས་ཀྱང་བསོད་ནམས་འཕེལ་བར་མི་སྨྲའོ་ཞེས་གསུངས་པའོ།
en: This is saying, “I do not say that they increase merit by accumulating it,” and “I do not say that they increase merit by not accumulating it” either.

source: །འོ་ན་ཇི་ལྟ་བུ་ཞེ་ན་བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་གང་དང་གང་བྱུང་བ་དེ་དག་རྟག་ཏུ་རྣམ་པ་ཐམས་ཅད་དུ་སྟོང་པ་ཉིད་དང་གསོག་དང་གསོབ་ཏུ་ཇི་ལྟར་སོ་སོར་བརྟག་པར་བྱ་ཞེ་ན།
en: How then? How should whatever the merit that bodhisattvas have to accumulate that has been obtained always in all respects be understood analytically as “just empty, in vain,” and as “just ringing hollow?”

source: དེ་ལྟར་སོ་སོར་རྟོག་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བའི་ཕྱིར། བསོད་ནམས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་འཕེལ་བར་འགྱུར་རོ་ཞེས་སྨྲའོ་ཞེས་བྱའོ།
en: When they understand analytically like that, because they “are inseparable from the perfection of wisdom… to that extent they make infinite, incalculable merit.” “

source: །བྱེ་བྲག་ནི་ཅི་ཞིག་མཆིས་ཞེས་བྱ་བ་སྐབས་སུ་བབ་པའི་ཕྱིར་ཞར་ལ་དྲིས་པ་སྟེ།
en: What are the specific features…?” He asks this as an aside because it is contextually appropriate. “

source: རབ་འབྱོར་གྲངས་མེད་པ་ཞེས་བྱ་བ་ནི་གང་ལ་བགྲང་དུ་མེད་པའོ་ཞེས་བྱ་བ་ལ་ཚིག་གིས་བགྲང་མི་ནུས་པ་ནི་གྲངས་མེད་པའོ།
en: Subhūti, the incalculable is that which has no enumeration.”

source: །དཔག་ཏུ་མེད་པ་ཞེས་བྱ་བ་ནི་དཔག་པར་མི་ནུས་པའོ།
en: That which cannot be enumerated by a word is incalculable; “the infinite” cannot be measured; and “the immeasurable” cannot be delimited as just this, even by the force of a calculation.

source: །གྲངས་ཀྱི་དབང་གིས་ཀྱང་འདི་ཙམ་མོ་ཞེས་ཡོངས་སུ་ཆད་པར་ཚད་གཟུང་དུ་མེད་པ་ནི་ཚད་མེད་པ་སྟེ།
en: Its measure cannot be apprehended.

source: འདི་གསུམ་ཆར་ཡང་བགྲང་བའི་བྱེ་བྲག་གོ། །གྲངས་ཀྱི་ཁམས་དང་གྲངས་མེད་པའི་ཁམས་ཞེས་བྱ་བ་ནི་འདུས་བྱས་ཀྱི་ཁམས་དང་འདུས་མ་བྱས་ཀྱི་ཁམས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: All three, furthermore, are particulars of counting. “A calculable element or an incalculable element” means “the compounded element and the uncompounded element.” “

source: །གཟུགས་ཀྱང་སྟོང་པ་གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པའོ་ཞེས་བྱ་བ་ནི་གྲངས་དང་ཚད་ལ་སོགས་པ་ནི་ཀུན་བརྟགས་པ་རྣམས་ལ་ཡོད་ཀྱི།
en: Form is also empty so it is infinite, incalculable, and immeasurable.” A number, measure, and so on exist for falsely imagined phenomena, but in the emptiness element they do not exist.

source: སྟོང་པ་ཉིད་ཀྱི་དབྱིངས་ལ་ནི་མེད་དེ་འདི་ནི་རྣམ་གྲངས་སུ་གཏོགས་པའོ།
en: They are included in synonyms of emptiness.

source: །དེ་བས་ན་གཟུགས་ཀྱང་སྟོང་པའོ་ཞེས་བྱེ་བྲག་ཡོད་པར་བྱ་བའི་ཕྱིར་ཡང་ཞེས་བྱ་བ་སྨོས་སོ།
en: Therefore, there is the word “also,” in “form is also empty,” in order to make it into a particular.

source: །སྙིང་རྗེ་ཆེན་པོས་བཤད་པའི་རྒྱུ་མཐུན་པ་བསྟན་པའི་ཉིད་དོ་ཞེས་བྱ་བ་ནི་ཀུན་རྫོབ་ཏུ་བཤད་པ་ནི་ཐུགས་རྗེའི་རྒྱུ་མཐུན་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: On account of great compassion, it is “an exposition in harmony with what causes a tathāgata’s teaching.” This means that it is conventionally an “exposition” in harmony with the cause, compassion. “

source: །བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱང་བརྗོད་དུ་མ་མཆིས་པའོ་ཞེས་བྱ་བ་ནི་སྔར་ཆོས་ཉིད་འབའ་ཞིག་བརྗོད་དུ་མེད་པར་བསྟན་ཏེ།
en: Lord, all phenomena are simply inexpressible?” Earlier it explained that just the true nature of dharmas is inexpressible.

source: ད་ནི་ཆོས་ཉིད་དང་ཐ་མི་དད་པའི་ཆོས་ཐམས་ཅད་ཀྱང་བརྗོད་དུ་མེད་པ་ཉིད་དོ་ཞེས་སྟོན་ཏོ།
en: Now it teaches that all dharmas, not different from the true nature of dharmas, are simply inexpressible too. “

source: །བཅོམ་ལྡན་འདས་ཅི་བརྗོད་དུ་མ་མཆིས་པའི་དོན་ལ་འཕེལ་བའམ།
en: Lord, does an inexpressible reality know increase or decrease?”

source: ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་སམ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདི་སྐད་བསྟན་ཏོ། །བརྗོད་དུ་མེད་པས་ནི་སྟོང་པ་ཉིད་དུ་བརྗོད་པས་སྟོང་པ་ཉིད་ནི་ཆོས་དཀར་པོའི་དབང་གིས་འཕེལ་བ་ཡང་མེད། ཆོས་ནག་པོའི་དབང་གིས་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ལ་ཡང་འཕེལ་བ་དང་འགྲིབ་པ་གཉིས་མེད་ན་འོ་ན་རྒྱུ་གང་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་སྐལ་བ་ཅན་དུ་འགྱུར་ཞེས་ཞུས་པ་སྟེ།
en: This teaches the following: it asks, if inexpressible is an expression for emptiness, and emptiness does not increase because of bright dharmas and does not decrease because of dark dharmas, and if the perfections and so on also have no increase or decrease, well then, on account of what cause will “the knowledge of all aspects come with the good fortune of fully awakening to unsurpassed, perfect, complete awakening?”

source: དེ་སྐད་ཞུས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཡོངས་སུ་བསྔོའོ་ཞེས་བྱ་བ་ཚིག་ཐ་མའི་གཞུང་གིས་ཐབས་མཁས་པས་ཡོངས་སུ་བསྔོས་པའི་སྟོབས་ཀྱིས་འགྱུར་བར་སྟོན་ཏོ།
en: Having asked that, the final part of the passage, “they will make a dedication just like unsurpassed, perfect, complete awakening,” teaches that it will happen because of the power of dedication with skillful means. “

source: །བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཇི་ལྟ་བུ་ལགས་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་སོགས་པ་དང་ཐ་དད་པ་མ་ཡིན་པའི་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དེ།
en: Lord, what is unsurpassed, perfect, complete awakening?” It has as its essential nature the emptiness not different from form and so on.

source: ཡང་བསྟན་པའི་ཕྱིར་ཞུས་པའོ།
en: The inquiry is made so there will be a further explanation. “[

source: །འཕེལ་བ་དང་། ཡོངས་སུ་འགྲིབ་པ་མེད་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ་ཞེས་བྱ་བས་ནི། འདི་གཅིག་པུའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡིན་པར་སྟོན་ཏོ།
en: They] should practice the perfection of wisdom like that, by way of no increase or decrease” teaches that just this alone is the practice of the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་ཅི་ལགས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ།
en: Which moment of thought causes awakening? “Lord, do bodhisattva great beings fully awaken to unsurpassed, perfect, complete awakening because of the first production of the thought, or do they fully awaken to unsurpassed, perfect, complete awakening because of a later production of the thought?”

source: འོན་ཏེ་སེམས་སླད་མ་བསྐྱེད་པས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞེས་བྱ་བ་ནི་ཟབ་མོའི་གནས་ཀྱི་སྐབས་ཞུས་པ་སྟེ།
en: This inquiry is in the part of the text to do with the deep places.

source: དགེ་བའི་རྩ་བ་བསྩགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ན། དེ་ལ་ཇི་ལྟར་དགེ་བའི་རྩ་བ་བསྩགས་པར་འགྱུར།
en: Given that those who have accumulated wholesome roots will fully awaken to unsurpassed, perfect, complete awakening, how will the wholesome roots for that come to be accumulated?

source: །ཅི་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་གྱི་སྔོན་རོལ་དུ་གང་ཐོག་མར་སེམས་བསྐྱེད་པ་དེའི་མཐས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ་འོན་ཏེ་གཉིས་པས་སམ། འོན་ཏེ་གསུམ་པས་སམ། འོན་ཏེ་ཅི་གང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་བཞུགས་པ་ན། ཐམས་ཅད་ཀྱི་ཐ་མར་སེམས་བསྐྱེད་པ་དེའི་མཐུས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: Here, do bodhisattvas fully awaken through the power of the initial production of the thought—produced prior to the first of three incalculable eons—or do they fully awaken through the power of the second, or the third, or the last of all the productions of the thought when they are seated at the site of awakening?

source: དེ་ལ་སེམས་གཅིག་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་ཏེ། དེ་ལ་དེ་ལྟ་བུའི་མཐུ་མེད་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ལྷག་མ་རྣམས་དོན་མེད་པར་འགྱུར་བའི་ཕྱིར་རོ། །ཐམས་ཅད་ཀྱིས་ཀྱང་མ་ཡིན་ཏེ།
en: In regard to those, they do not fully awaken because of a single thought, because it does not have such power and the rest of the accumulation of merit would be meaningless.

source: དེ་དག་སྐད་ཅིག་རེ་རེ་ལ་འཇིགས་པའི་ངང་ཅན་ཡིན་པས་བསྩགས་སུ་མི་རུང་བའི་ཕྱིར་རོ་ཞེས་བསྟན་པ་སྟེ།
en: It is also not because of all the thoughts either, because they are not suited to accumulation, since they are destined to perish instant by instant.

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་མར་མེའི་དཔེ་བསྟན་པ། གང་གི་ཚེ་མར་མེའི་སྙིང་པོ་ཚིག་པ་ནི་སྐད་ཅིག་རེ་རེ་ལ་འཇིགས་པའི་ངང་ཅན་ཡིན་ཡང་། མར་མེའི་སྐད་ཅིག་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱིས་ཚིག་པར་གྱུར་ཅེས་བྱའོ།
en: That is what it teaches, so there the Lord gives “the illustration of an oil lamp” saying that when the wick of an oil lamp is burned up, it has been burned up through the power of all the instants of flame, even though each is destined to perish instant by instant.

source: །དེ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཡང་སེམས་ཐམས་ཅད་ཀྱི་མཐུས་འགྱུར་བར་བསྟན་པ་སྟེ། སྐད་ཅིག་པ་ཡིན་དུ་ཟིན་ཀྱང་། འདུ་བྱེད་ཀྱི་བག་ཆགས་བསྩགས་པའི་ཚུལ་གྱིས་འགྱུར་རོ་ཞེས་དགོངས་པའོ། །དཀར་པོ་རྣམ་པར་མཐོང་བའི་ས་ནི་ལྷག་མཐོང་གི་ཚེའོ། །རིགས་ཀྱི་ས་ནི་འཇིག་རྟེན་པའི་ཆོས་ཀྱི་མཆོག་གོ། །བརྒྱད་པའི་ས་ནི་རྒྱུན་དུ་ཞུགས་པའི་ལམ་མོ། །དེ་ཉིད་ཀྱི་འབྲས་བུ་ནི་མཐོང་བའི་སའོ། །བསྲབ་པའི་ས་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་ས་སྟེ། དེས་འདོད་པ་ལ་འདོད་ཆགས་དང་། གནོད་སེམས་བསྲབས་པའི་ཕྱིར་རོ། །འདོད་ཆགས་དང་བྲལ་བའི་ས་ནི་ཕྱིར་མི་འོང་བའི་ས་སྟེ།
en: Similarly, it teaches that full awakening too is through the power of all the thoughts, intending that even though they are momentary it is by way of accumulated habit formation. “

source: འདོད་ཆགས་དང་གནོད་སེམས་གཉིས་སྤངས་པའི་ཕྱིར་རོ། །བྱས་པ་རྟོགས་པའི་ས་ནི་དགྲ་བཅོམ་པ་ཉིད་དེ། བྱ་བ་བྱས་པའི་ཕྱིར་རོ། །རང་སངས་རྒྱས་ཀྱི་ས་ནི་རང་བྱང་ཆུབ་ཉིད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་ས་ནི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དོ། །སངས་རྒྱས་ཀྱི་ས་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: The Śuklavipaśyanā level is when there is special insight; “the Gotra level” is the highest ordinary dharma; “the Aṣṭamaka level” is the path of the stream enterers; “the Darśana level” is their result, the level of seeing; “the Tanū level” is the once-returner level because it has attenuated attachment to sense objects and malice; “the Vītarāga level” is the non-returner level because attachment and malice have been stopped; “the Kṛtāvin level” is the state of a worthy one because the work has been done; “the Pratyekabuddha level” is a pratyekabuddha’s awakening; “the Bodhisattva level” is the knowledge of path aspects; and “the Buddha level” is the knowledge of all aspects. “

source: །གཞན་ཡང་སེམས་གང་འགགས་པ་དེའི་ཕྱིར་སྐྱེ་བར་འགྱུར་རམ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཟབ་མོའི་གནས་སྐབས་སྟོན་ཏོ།
en: Will that thought which has stopped be produced again?” and so on, again teaches the deep state. “
